---
kind: property
id: P:Autodesk.Revit.DB.TriangulatedShellComponent.TriangleCount
source: html/f9cce633-ba6a-2441-528a-be064372f15f.htm
---
# Autodesk.Revit.DB.TriangulatedShellComponent.TriangleCount Property

The number of triangles in the triangulation.

## Syntax (C#)
```csharp
public int TriangleCount { get; }
```